# 给定下面的数，将其分成任意两个部分，使得两个部分的和的乘积最大。
nums = [5634, 2891, 1948, 1092, 5720, 7461, 3719, 6493, 9567, 4203,
        1257, 8105, 3126, 9283, 3409, 7392, 6084, 4785, 1673, 8514,
        3046, 7021, 1415, 5267, 9938, 7856, 4152, 2480, 5348, 1629,
        9187, 3205, 6918, 2037, 8542, 1001, 7693, 9731, 4568, 7301]


sort_list = sorted(nums)

list1 = []
list2 = []

for i in range(40):
    if i % 2 == 0:
        list1.append(sort_list[i])
    else:
        list2.append(sort_list[i])

print(sum(list1), sum(list2))


